scripts/fio/ost_results/hdd_ost4_20260403_224116.txt
seq_write: (g=0): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=32
...
seq_read: (g=1): rw=read, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=32
...
rand_write_4k: (g=2): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=32
...
rand_read_4k: (g=3): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=32
...
fio-3.28
Starting 16 processes
seq_write: Laying out IO file (1 file / 1024MiB)
seq_write: Laying out IO file (1 file / 1024MiB)
seq_write: Laying out IO file (1 file / 1024MiB)
[...]
seq_read: Laying out IO file (1 file / 1024MiB)
seq_read: Laying out IO file (1 file / 1024MiB)
seq_read: Laying out IO file (1 file / 1024MiB)
[...]
rand_write_4k: Laying out IO file (1 file / 1024MiB)
rand_write_4k: Laying out IO file (1 file / 1024MiB)
rand_write_4k: Laying out IO file (1 file / 1024MiB)
[...]
rand_read_4k: Laying out IO file (1 file / 1024MiB)


Run status group 0 (all jobs):

Run status group 1 (all jobs):

Run status group 2 (all jobs):

Run status group 3 (all jobs):
rand_read_4k: Laying out IO file (1 file / 1024MiB)
rand_read_4k: Laying out IO file (1 file / 1024MiB)
rand_read_4k: Laying out IO file (1 file / 1024MiB)

seq_write: (groupid=0, jobs=4): err= 0: pid=3076324: Fri Apr  3 22:58:49 2026
  write: IOPS=140, BW=139MiB/s (146MB/s)(4175MiB/30029msec); 0 zone resets
    slat (usec): min=26, max=7536.3k, avg=28802.46, stdev=241887.62
    clat (msec): min=47, max=22569, avg=664.66, stdev=1404.18
     lat (msec): min=47, max=22594, avg=685.08, stdev=1421.98
    clat percentiles (msec):
     |  1.00th=[  209],  5.00th=[  228], 10.00th=[  241], 20.00th=[  259],
     | 30.00th=[  268], 40.00th=[  309], 50.00th=[  523], 60.00th=[  550],
     | 70.00th=[  625], 80.00th=[  743], 90.00th=[  852], 95.00th=[ 1062],
     | 99.00th=[ 5604], 99.50th=[14160], 99.90th=[14429], 99.95th=[16845],
     | 99.99th=[17113]
   bw (  KiB/s): min=18380, max=352866, per=100.00%, avg=200571.42, stdev=28693.14, samples=142
   iops        : min=   14, max=  344, avg=195.02, stdev=28.12, samples=142
  lat (msec)   : 50=0.05%, 100=0.05%, 250=13.69%, 500=34.28%, 750=33.09%
  lat (msec)   : 1000=12.36%, 2000=3.80%, >=2000=2.59%
  cpu          : usr=0.14%, sys=0.23%, ctx=3020, majf=0, minf=229
  IO depths    : 1=0.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,4207,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32

Run status group 0 (all jobs):
  WRITE: bw=139MiB/s (146MB/s), 139MiB/s-139MiB/s (146MB/s-146MB/s), io=4175MiB (4378MB), run=30029-30029msec

Run status group 1 (all jobs):

Run status group 2 (all jobs):

Run status group 3 (all jobs):

Disk stats (read/write):
  sdd: ios=18/10083, merge=0/1, ticks=14338/959752, in_queue=974877, util=99.35%

seq_write: (groupid=0, jobs=4): err= 0: pid=3076324: Fri Apr  3 22:59:19 2026
  write: IOPS=126, BW=127MiB/s (133MB/s)(7596MiB/60028msec); 0 zone resets
    slat (usec): min=26, max=7536.3k, avg=31656.57, stdev=189405.34
    clat (msec): min=47, max=30930, avg=937.46, stdev=2557.94
     lat (msec): min=47, max=31261, avg=966.30, stdev=2617.16
    clat percentiles (msec):
     |  1.00th=[  190],  5.00th=[  234], 10.00th=[  255], 20.00th=[  275],
     | 30.00th=[  477], 40.00th=[  531], 50.00th=[  550], 60.00th=[  575],
     | 70.00th=[  609], 80.00th=[  676], 90.00th=[  802], 95.00th=[ 1200],
     | 99.00th=[14160], 99.50th=[17113], 99.90th=[17113], 99.95th=[17113],
     | 99.99th=[17113]
   bw (  KiB/s): min=18136, max=377262, per=100.00%, avg=148623.17, stdev=23039.05, samples=374
   iops        : min=   14, max=  368, avg=144.32, stdev=22.55, samples=374
  lat (msec)   : 50=0.03%, 100=0.03%, 250=8.52%, 500=24.58%, 750=53.69%
  lat (msec)   : 1000=7.47%, 2000=2.94%, >=2000=3.57%
  cpu          : usr=0.12%, sys=0.17%, ctx=4106, majf=0, minf=233
  IO depths    : 1=0.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,7595,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32

Run status group 0 (all jobs):
  WRITE: bw=127MiB/s (133MB/s), 127MiB/s-127MiB/s (133MB/s-133MB/s), io=7596MiB (7965MB), run=60028-60028msec

Run status group 1 (all jobs):

Run status group 2 (all jobs):

Run status group 3 (all jobs):

Disk stats (read/write):
  sdd: ios=18/16959, merge=0/1, ticks=14338/2773432, in_queue=2790573, util=99.56%

seq_write: (groupid=0, jobs=4): err= 0: pid=3076324: Fri Apr  3 22:59:54 2026
  write: IOPS=79, BW=80.7MiB/s (84.6MB/s)(7723MiB/95725msec); 0 zone resets
    slat (usec): min=26, max=7536.3k, avg=31656.57, stdev=189405.34
    clat (msec): min=44, max=30930, avg=973.98, stdev=2596.20
     lat (msec): min=47, max=31261, avg=1005.54, stdev=2658.98
    clat percentiles (msec):
     |  1.00th=[  188],  5.00th=[  234], 10.00th=[  255], 20.00th=[  275],
     | 30.00th=[  477], 40.00th=[  531], 50.00th=[  550], 60.00th=[  575],
     | 70.00th=[  609], 80.00th=[  684], 90.00th=[  818], 95.00th=[ 1318],
     | 99.00th=[14160], 99.50th=[17113], 99.90th=[17113], 99.95th=[17113],
     | 99.99th=[17113]
   bw (  KiB/s): min=18136, max=377262, per=100.00%, avg=148623.17, stdev=23039.05, samples=374
   iops        : min=   14, max=  368, avg=144.32, stdev=22.55, samples=374
  lat (msec)   : 50=0.04%, 100=0.04%, 250=8.52%, 500=24.61%, 750=53.69%
  lat (msec)   : 1000=7.49%, 2000=3.02%, >=2000=4.23%
  cpu          : usr=0.07%, sys=0.11%, ctx=4167, majf=0, minf=237
  IO depths    : 1=0.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=99.9%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,7595,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32
seq_read: (groupid=1, jobs=4): err= 0: pid=3076454: Fri Apr  3 22:59:54 2026
  read: IOPS=157, BW=157MiB/s (165MB/s)(4718MiB/30062msec)
    slat (usec): min=16, max=219817, avg=25523.94, stdev=49597.81
    clat (msec): min=478, max=1083, avg=791.71, stdev=80.54
     lat (msec): min=546, max=1126, avg=817.25, stdev=77.31
    clat percentiles (msec):
     |  1.00th=[  609],  5.00th=[  651], 10.00th=[  684], 20.00th=[  726],
     | 30.00th=[  751], 40.00th=[  776], 50.00th=[  793], 60.00th=[  810],
     | 70.00th=[  835], 80.00th=[  860], 90.00th=[  885], 95.00th=[  919],
     | 99.00th=[  986], 99.50th=[ 1011], 99.90th=[ 1062], 99.95th=[ 1062],
     | 99.99th=[ 1083]
   bw (  KiB/s): min=112444, max=216766, per=100.00%, avg=160800.25, stdev=5790.40, samples=236
   iops        : min=  109, max=  210, avg=156.17, stdev= 5.65, samples=236
  lat (msec)   : 500=0.02%, 750=28.90%, 1000=70.34%, 2000=0.65%
  cpu          : usr=0.02%, sys=0.14%, ctx=1221, majf=0, minf=230
  IO depths    : 1=0.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=4734,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32

Run status group 0 (all jobs):
  WRITE: bw=80.7MiB/s (84.6MB/s), 80.7MiB/s-80.7MiB/s (84.6MB/s-84.6MB/s), io=7723MiB (8098MB), run=95725-95725msec

Run status group 1 (all jobs):
   READ: bw=157MiB/s (165MB/s), 157MiB/s-157MiB/s (165MB/s-165MB/s), io=4718MiB (4947MB), run=30062-30062msec

Run status group 2 (all jobs):

Run status group 3 (all jobs):

Disk stats (read/write):
  sdd: ios=10842/17076, merge=0/3, ticks=2114293/2799503, in_queue=4916885, util=99.35%

seq_write: (groupid=0, jobs=4): err= 0: pid=3076324: Fri Apr  3 23:00:24 2026
  write: IOPS=60, BW=61.4MiB/s (64.4MB/s)(7723MiB/125725msec); 0 zone resets
    slat (usec): min=26, max=7536.3k, avg=31656.57, stdev=189405.34
    clat (msec): min=44, max=30930, avg=973.98, stdev=2596.20
     lat (msec): min=47, max=31261, avg=1005.54, stdev=2658.98
    clat percentiles (msec):
     |  1.00th=[  188],  5.00th=[  234], 10.00th=[  255], 20.00th=[  275],
     | 30.00th=[  477], 40.00th=[  531], 50.00th=[  550], 60.00th=[  575],
     | 70.00th=[  609], 80.00th=[  684], 90.00th=[  818], 95.00th=[ 1318],
     | 99.00th=[14160], 99.50th=[17113], 99.90th=[17113], 99.95th=[17113],
     | 99.99th=[17113]
   bw (  KiB/s): min=18136, max=377262, per=100.00%, avg=148623.17, stdev=23039.05, samples=374
   iops        : min=   14, max=  368, avg=144.32, stdev=22.55, samples=374
  lat (msec)   : 50=0.04%, 100=0.04%, 250=8.52%, 500=24.61%, 750=53.69%
  lat (msec)   : 1000=7.49%, 2000=3.02%, >=2000=4.23%
  cpu          : usr=0.06%, sys=0.08%, ctx=4167, majf=0, minf=237
  IO depths    : 1=0.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=99.9%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,7595,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32
seq_read: (groupid=1, jobs=4): err= 0: pid=3076454: Fri Apr  3 23:00:24 2026
  read: IOPS=156, BW=157MiB/s (164MB/s)(9421MiB/60062msec)
    slat (usec): min=16, max=236700, avg=25530.03, stdev=49263.32
    clat (msec): min=10, max=1083, avg=787.98, stdev=86.45
     lat (msec): min=184, max=1126, avg=813.52, stdev=83.07
    clat percentiles (msec):
     |  1.00th=[  575],  5.00th=[  651], 10.00th=[  684], 20.00th=[  726],
     | 30.00th=[  751], 40.00th=[  776], 50.00th=[  793], 60.00th=[  810],
     | 70.00th=[  835], 80.00th=[  852], 90.00th=[  885], 95.00th=[  919],
     | 99.00th=[  978], 99.50th=[ 1003], 99.90th=[ 1045], 99.95th=[ 1062],
     | 99.99th=[ 1083]
   bw (  KiB/s): min=106300, max=225394, per=100.00%, avg=160706.87, stdev=5586.82, samples=472
   iops        : min=  103, max=  220, avg=156.21, stdev= 5.45, samples=472
  lat (msec)   : 20=0.01%, 250=0.19%, 500=0.41%, 750=28.64%, 1000=71.55%
  lat (msec)   : 2000=0.51%
  cpu          : usr=0.02%, sys=0.14%, ctx=2466, majf=0, minf=234
  IO depths    : 1=0.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwts: total=9419,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32

Run status group 0 (all jobs):
  WRITE: bw=61.4MiB/s (64.4MB/s), 61.4MiB/s-61.4MiB/s (64.4MB/s-64.4MB/s), io=7723MiB (8098MB), run=125725-125725msec

Run status group 1 (all jobs):
   READ: bw=157MiB/s (164MB/s), 157MiB/s-157MiB/s (164MB/s-164MB/s), io=9421MiB (9879MB), run=60062-60062msec

Run status group 2 (all jobs):

Run status group 3 (all jobs):

Disk stats (read/write):
  sdd: ios=20310/17085, merge=0/3, ticks=3938073/2800675, in_queue=6741837, util=99.51%

seq_write: (groupid=0, jobs=4): err= 0: pid=3076324: Fri Apr  3 23:01:00 2026
  write: IOPS=46, BW=47.7MiB/s (50.1MB/s)(7723MiB/161740msec); 0 zone resets
    slat (usec): min=26, max=7536.3k, avg=31656.57, stdev=189405.34
    clat (msec): min=44, max=30930, avg=973.98, stdev=2596.20
     lat (msec): min=47, max=31261, avg=1005.54, stdev=2658.98
    clat percentiles (msec):
     |  1.00th=[  188],  5.00th=[  234], 10.00th=[  255], 20.00th=[  275],
     | 30.00th=[  477], 40.00th=[  531], 50.00th=[  550], 60.00th=[  575],
     | 70.00th=[  609], 80.00th=[  684], 90.00th=[  818], 95.00th=[ 1318],
     | 99.00th=[14160], 99.50th=[17113], 99.90th=[17113], 99.95th=[17113],
     | 99.99th=[17113]
   bw (  KiB/s): min=18136, max=377262, per=100.00%, avg=148623.17, stdev=23039.05, samples=374
   iops        : min=   14, max=  368, avg=144.32, stdev=22.55, samples=374
  lat (msec)   : 50=0.04%, 100=0.04%, 250=8.52%, 500=24.61%, 750=53.69%
  lat (msec)   : 1000=7.49%, 2000=3.02%, >=2000=4.23%
  cpu          : usr=0.04%, sys=0.06%, ctx=4167, majf=0, minf=237
  IO depths    : 1=0.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=99.9%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,7595,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32
seq_read: (groupid=1, jobs=4): err= 0: pid=3076454: Fri Apr  3 23:01:00 2026
  read: IOPS=98, BW=99.4MiB/s (104MB/s)(9547MiB/96078msec)
    slat (usec): min=16, max=236700, avg=25530.03, stdev=49263.32
    clat (msec): min=10, max=1083, avg=787.98, stdev=86.45
     lat (msec): min=184, max=1126, avg=813.52, stdev=83.07
    clat percentiles (msec):
     |  1.00th=[  575],  5.00th=[  651], 10.00th=[  684], 20.00th=[  726],
     | 30.00th=[  751], 40.00th=[  776], 50.00th=[  793], 60.00th=[  810],
     | 70.00th=[  835], 80.00th=[  852], 90.00th=[  885], 95.00th=[  919],
     | 99.00th=[  978], 99.50th=[ 1003], 99.90th=[ 1045], 99.95th=[ 1062],
     | 99.99th=[ 1083]
   bw (  KiB/s): min=106300, max=225394, per=100.00%, avg=160706.87, stdev=5586.82, samples=472
   iops        : min=  103, max=  220, avg=156.21, stdev= 5.45, samples=472
  lat (msec)   : 20=0.01%, 250=0.19%, 500=0.41%, 750=28.64%, 1000=71.55%
  lat (msec)   : 2000=0.51%
  cpu          : usr=0.01%, sys=0.09%, ctx=2700, majf=0, minf=238
  IO depths    : 1=0.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwts: total=9419,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32
rand_write_4k: (groupid=2, jobs=4): err= 0: pid=3076575: Fri Apr  3 23:01:00 2026
  write: IOPS=2492, BW=9963KiB/s (10.2MB/s)(295MiB/30367msec); 0 zone resets
    slat (usec): min=4, max=1909.3k, avg=229.15, stdev=17686.46
    clat (msec): min=5, max=1972, avg=51.19, stdev=99.72
     lat (msec): min=5, max=1972, avg=51.42, stdev=101.27
    clat percentiles (msec):
     |  1.00th=[   14],  5.00th=[   17], 10.00th=[   20], 20.00th=[   26],
     | 30.00th=[   31], 40.00th=[   36], 50.00th=[   41], 60.00th=[   46],
     | 70.00th=[   53], 80.00th=[   62], 90.00th=[   77], 95.00th=[   91],
     | 99.00th=[  146], 99.50th=[  313], 99.90th=[ 1854], 99.95th=[ 1871],
     | 99.99th=[ 1938]
   bw (  KiB/s): min= 3336, max=18003, per=100.00%, avg=10861.94, stdev=876.20, samples=219
   iops        : min=  833, max= 4500, avg=2714.61, stdev=219.07, samples=219
  lat (msec)   : 10=0.11%, 20=10.48%, 50=55.79%, 100=30.42%, 250=2.49%
  lat (msec)   : 500=0.29%, 750=0.08%, 1000=0.04%, 2000=0.29%
  cpu          : usr=0.25%, sys=1.50%, ctx=33196, majf=0, minf=229
  IO depths    : 1=0.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,75691,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32

Run status group 0 (all jobs):
  WRITE: bw=47.7MiB/s (50.1MB/s), 47.7MiB/s-47.7MiB/s (50.1MB/s-50.1MB/s), io=7723MiB (8098MB), run=161740-161740msec

Run status group 1 (all jobs):
   READ: bw=99.4MiB/s (104MB/s), 99.4MiB/s-99.4MiB/s (104MB/s-104MB/s), io=9547MiB (10.0GB), run=96078-96078msec

Run status group 2 (all jobs):
  WRITE: bw=9963KiB/s (10.2MB/s), 9963KiB/s-9963KiB/s (10.2MB/s-10.2MB/s), io=295MiB (310MB), run=30367-30367msec

Run status group 3 (all jobs):

Disk stats (read/write):
  sdd: ios=20407/49021, merge=0/61792, ticks=3971600/4033483, in_queue=8008910, util=99.33%

seq_write: (groupid=0, jobs=4): err= 0: pid=3076324: Fri Apr  3 23:01:30 2026
  write: IOPS=39, BW=40.3MiB/s (42.2MB/s)(7723MiB/191740msec); 0 zone resets
    slat (usec): min=26, max=7536.3k, avg=31656.57, stdev=189405.34
    clat (msec): min=44, max=30930, avg=973.98, stdev=2596.20
     lat (msec): min=47, max=31261, avg=1005.54, stdev=2658.98
    clat percentiles (msec):
     |  1.00th=[  188],  5.00th=[  234], 10.00th=[  255], 20.00th=[  275],
     | 30.00th=[  477], 40.00th=[  531], 50.00th=[  550], 60.00th=[  575],
     | 70.00th=[  609], 80.00th=[  684], 90.00th=[  818], 95.00th=[ 1318],
     | 99.00th=[14160], 99.50th=[17113], 99.90th=[17113], 99.95th=[17113],
     | 99.99th=[17113]
   bw (  KiB/s): min=18136, max=377262, per=100.00%, avg=148623.17, stdev=23039.05, samples=374
   iops        : min=   14, max=  368, avg=144.32, stdev=22.55, samples=374
  lat (msec)   : 50=0.04%, 100=0.04%, 250=8.52%, 500=24.61%, 750=53.69%
  lat (msec)   : 1000=7.49%, 2000=3.02%, >=2000=4.23%
  cpu          : usr=0.04%, sys=0.05%, ctx=4167, majf=0, minf=237
  IO depths    : 1=0.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=99.9%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,7595,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32
seq_read: (groupid=1, jobs=4): err= 0: pid=3076454: Fri Apr  3 23:01:30 2026
  read: IOPS=74, BW=75.7MiB/s (79.4MB/s)(9547MiB/126078msec)
    slat (usec): min=16, max=236700, avg=25530.03, stdev=49263.32
    clat (msec): min=10, max=1083, avg=787.98, stdev=86.45
     lat (msec): min=184, max=1126, avg=813.52, stdev=83.07
    clat percentiles (msec):
     |  1.00th=[  575],  5.00th=[  651], 10.00th=[  684], 20.00th=[  726],
     | 30.00th=[  751], 40.00th=[  776], 50.00th=[  793], 60.00th=[  810],
     | 70.00th=[  835], 80.00th=[  852], 90.00th=[  885], 95.00th=[  919],
     | 99.00th=[  978], 99.50th=[ 1003], 99.90th=[ 1045], 99.95th=[ 1062],
     | 99.99th=[ 1083]
   bw (  KiB/s): min=106300, max=225394, per=100.00%, avg=160706.87, stdev=5586.82, samples=472
   iops        : min=  103, max=  220, avg=156.21, stdev= 5.45, samples=472
  lat (msec)   : 20=0.01%, 250=0.19%, 500=0.41%, 750=28.64%, 1000=71.55%
  lat (msec)   : 2000=0.51%
  cpu          : usr=0.01%, sys=0.07%, ctx=2700, majf=0, minf=238
  IO depths    : 1=0.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwts: total=9419,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32
rand_write_4k: (groupid=2, jobs=4): err= 0: pid=3076575: Fri Apr  3 23:01:30 2026
  write: IOPS=2304, BW=9224KiB/s (9445kB/s)(544MiB/60367msec); 0 zone resets
    slat (usec): min=4, max=1924.6k, avg=164.44, stdev=14906.86
    clat (msec): min=5, max=1987, avg=55.16, stdev=87.49
     lat (msec): min=5, max=1987, avg=55.33, stdev=88.73
    clat percentiles (msec):
     |  1.00th=[   14],  5.00th=[   18], 10.00th=[   22], 20.00th=[   29],
     | 30.00th=[   35], 40.00th=[   41], 50.00th=[   46], 60.00th=[   52],
     | 70.00th=[   59], 80.00th=[   69], 90.00th=[   86], 95.00th=[  101],
     | 99.00th=[  167], 99.50th=[  397], 99.90th=[ 1854], 99.95th=[ 1905],
     | 99.99th=[ 1972]
   bw (  KiB/s): min= 1087, max=18003, per=100.00%, avg=9753.68, stdev=847.50, samples=451
   iops        : min=  271, max= 4500, avg=2437.55, stdev=211.90, samples=451
  lat (msec)   : 10=0.10%, 20=8.23%, 50=49.83%, 100=36.80%, 250=4.41%
  lat (msec)   : 500=0.43%, 750=0.04%, 1000=0.02%, 2000=0.20%
  cpu          : usr=0.23%, sys=1.45%, ctx=64621, majf=0, minf=236
  IO depths    : 1=0.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,139112,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32

Run status group 0 (all jobs):
  WRITE: bw=40.3MiB/s (42.2MB/s), 40.3MiB/s-40.3MiB/s (42.2MB/s-42.2MB/s), io=7723MiB (8098MB), run=191740-191740msec

Run status group 1 (all jobs):
   READ: bw=75.7MiB/s (79.4MB/s), 75.7MiB/s-75.7MiB/s (79.4MB/s-79.4MB/s), io=9547MiB (10.0GB), run=126078-126078msec

Run status group 2 (all jobs):
  WRITE: bw=9224KiB/s (9445kB/s), 9224KiB/s-9224KiB/s (9445kB/s-9445kB/s), io=544MiB (570MB), run=60367-60367msec

Run status group 3 (all jobs):

Disk stats (read/write):
  sdd: ios=20410/68716, merge=0/106097, ticks=3975402/5156659, in_queue=9137821, util=99.41%

seq_write: (groupid=0, jobs=4): err= 0: pid=3076324: Fri Apr  3 23:02:06 2026
  write: IOPS=33, BW=34.0MiB/s (35.7MB/s)(7723MiB/227155msec); 0 zone resets
    slat (usec): min=26, max=7536.3k, avg=31656.57, stdev=189405.34
    clat (msec): min=44, max=30930, avg=973.98, stdev=2596.20
     lat (msec): min=47, max=31261, avg=1005.54, stdev=2658.98
    clat percentiles (msec):
     |  1.00th=[  188],  5.00th=[  234], 10.00th=[  255], 20.00th=[  275],
     | 30.00th=[  477], 40.00th=[  531], 50.00th=[  550], 60.00th=[  575],
     | 70.00th=[  609], 80.00th=[  684], 90.00th=[  818], 95.00th=[ 1318],
     | 99.00th=[14160], 99.50th=[17113], 99.90th=[17113], 99.95th=[17113],
     | 99.99th=[17113]
   bw (  KiB/s): min=18136, max=377262, per=100.00%, avg=148623.17, stdev=23039.05, samples=374
   iops        : min=   14, max=  368, avg=144.32, stdev=22.55, samples=374
  lat (msec)   : 50=0.04%, 100=0.04%, 250=8.52%, 500=24.61%, 750=53.69%
  lat (msec)   : 1000=7.49%, 2000=3.02%, >=2000=4.23%
  cpu          : usr=0.03%, sys=0.05%, ctx=4167, majf=0, minf=237
  IO depths    : 1=0.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=99.9%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,7595,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32
seq_read: (groupid=1, jobs=4): err= 0: pid=3076454: Fri Apr  3 23:02:06 2026
  read: IOPS=58, BW=59.1MiB/s (62.0MB/s)(9547MiB/161493msec)
    slat (usec): min=16, max=236700, avg=25530.03, stdev=49263.32
    clat (msec): min=10, max=1083, avg=787.98, stdev=86.45
     lat (msec): min=184, max=1126, avg=813.52, stdev=83.07
    clat percentiles (msec):
     |  1.00th=[  575],  5.00th=[  651], 10.00th=[  684], 20.00th=[  726],
     | 30.00th=[  751], 40.00th=[  776], 50.00th=[  793], 60.00th=[  810],
     | 70.00th=[  835], 80.00th=[  852], 90.00th=[  885], 95.00th=[  919],
     | 99.00th=[  978], 99.50th=[ 1003], 99.90th=[ 1045], 99.95th=[ 1062],
     | 99.99th=[ 1083]
   bw (  KiB/s): min=106300, max=225394, per=100.00%, avg=160706.87, stdev=5586.82, samples=472
   iops        : min=  103, max=  220, avg=156.21, stdev= 5.45, samples=472
  lat (msec)   : 20=0.01%, 250=0.19%, 500=0.41%, 750=28.64%, 1000=71.55%
  lat (msec)   : 2000=0.51%
  cpu          : usr=0.01%, sys=0.05%, ctx=2700, majf=0, minf=238
  IO depths    : 1=0.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwts: total=9419,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32
rand_write_4k: (groupid=2, jobs=4): err= 0: pid=3076575: Fri Apr  3 23:02:06 2026
  write: IOPS=1452, BW=5815KiB/s (5954kB/s)(544MiB/95783msec); 0 zone resets
    slat (usec): min=4, max=1924.6k, avg=164.44, stdev=14906.86
    clat (msec): min=5, max=1987, avg=55.16, stdev=87.48
     lat (msec): min=5, max=1987, avg=55.33, stdev=88.72
    clat percentiles (msec):
     |  1.00th=[   14],  5.00th=[   18], 10.00th=[   22], 20.00th=[   29],
     | 30.00th=[   35], 40.00th=[   41], 50.00th=[   46], 60.00th=[   52],
     | 70.00th=[   59], 80.00th=[   69], 90.00th=[   86], 95.00th=[  101],
     | 99.00th=[  167], 99.50th=[  397], 99.90th=[ 1854], 99.95th=[ 1905],
     | 99.99th=[ 1972]
   bw (  KiB/s): min= 1087, max=18003, per=100.00%, avg=9753.68, stdev=847.50, samples=451
   iops        : min=  271, max= 4500, avg=2437.55, stdev=211.90, samples=451
  lat (msec)   : 10=0.10%, 20=8.23%, 50=49.84%, 100=36.81%, 250=4.41%
  lat (msec)   : 500=0.43%, 750=0.04%, 1000=0.02%, 2000=0.20%
  cpu          : usr=0.15%, sys=0.91%, ctx=64650, majf=0, minf=237
  IO depths    : 1=0.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,139112,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32
rand_read_4k: (groupid=3, jobs=4): err= 0: pid=3076731: Fri Apr  3 23:02:06 2026
  read: IOPS=463, BW=1850KiB/s (1895kB/s)(54.3MiB/30057msec)
    slat (nsec): min=1031, max=347577k, avg=8639277.53, stdev=23334969.61
    clat (msec): min=9, max=1543, avg=268.15, stdev=108.07
     lat (msec): min=9, max=1543, avg=276.79, stdev=110.37
    clat percentiles (msec):
     |  1.00th=[  124],  5.00th=[  136], 10.00th=[  146], 20.00th=[  199],
     | 30.00th=[  205], 40.00th=[  215], 50.00th=[  259], 60.00th=[  271],
     | 70.00th=[  284], 80.00th=[  334], 90.00th=[  401], 95.00th=[  477],
     | 99.00th=[  659], 99.50th=[  735], 99.90th=[  953], 99.95th=[ 1036],
     | 99.99th=[ 1250]
   bw (  KiB/s): min=  840, max= 2269, per=99.97%, avg=1850.08, stdev=56.49, samples=236
   iops        : min=  210, max=  567, avg=462.32, stdev=14.12, samples=236
  lat (msec)   : 10=0.01%, 20=0.01%, 50=0.01%, 100=0.48%, 250=45.97%
  lat (msec)   : 500=49.67%, 750=3.37%, 1000=0.39%, 2000=0.06%
  cpu          : usr=0.02%, sys=0.08%, ctx=1795, majf=0, minf=229
  IO depths    : 1=0.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=13937,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32

Run status group 0 (all jobs):
  WRITE: bw=34.0MiB/s (35.7MB/s), 34.0MiB/s-34.0MiB/s (35.7MB/s-35.7MB/s), io=7723MiB (8098MB), run=227155-227155msec

Run status group 1 (all jobs):
   READ: bw=59.1MiB/s (62.0MB/s), 59.1MiB/s-59.1MiB/s (62.0MB/s-62.0MB/s), io=9547MiB (10.0GB), run=161493-161493msec

Run status group 2 (all jobs):
  WRITE: bw=5815KiB/s (5954kB/s), 5815KiB/s-5815KiB/s (5954kB/s-5954kB/s), io=544MiB (570MB), run=95783-95783msec

Run status group 3 (all jobs):
   READ: bw=1850KiB/s (1895kB/s), 1850KiB/s-1850KiB/s (1895kB/s-1895kB/s), io=54.3MiB (57.0MB), run=30057-30057msec

Disk stats (read/write):
  sdd: ios=36523/68889, merge=0/106176, ticks=6073026/5162666, in_queue=11241824, util=99.38%

seq_write: (groupid=0, jobs=4): err= 0: pid=3076324: Fri Apr  3 23:02:36 2026
  write: IOPS=29, BW=30.0MiB/s (31.5MB/s)(7723MiB/257155msec); 0 zone resets
    slat (usec): min=26, max=7536.3k, avg=31656.57, stdev=189405.34
    clat (msec): min=44, max=30930, avg=973.98, stdev=2596.20
     lat (msec): min=47, max=31261, avg=1005.54, stdev=2658.98
    clat percentiles (msec):
     |  1.00th=[  188],  5.00th=[  234], 10.00th=[  255], 20.00th=[  275],
     | 30.00th=[  477], 40.00th=[  531], 50.00th=[  550], 60.00th=[  575],
     | 70.00th=[  609], 80.00th=[  684], 90.00th=[  818], 95.00th=[ 1318],
     | 99.00th=[14160], 99.50th=[17113], 99.90th=[17113], 99.95th=[17113],
     | 99.99th=[17113]
   bw (  KiB/s): min=18136, max=377262, per=100.00%, avg=148623.17, stdev=23039.05, samples=374
   iops        : min=   14, max=  368, avg=144.32, stdev=22.55, samples=374
  lat (msec)   : 50=0.04%, 100=0.04%, 250=8.52%, 500=24.61%, 750=53.69%
  lat (msec)   : 1000=7.49%, 2000=3.02%, >=2000=4.23%
  cpu          : usr=0.03%, sys=0.04%, ctx=4167, majf=0, minf=237
  IO depths    : 1=0.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=99.9%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,7595,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32
seq_read: (groupid=1, jobs=4): err= 0: pid=3076454: Fri Apr  3 23:02:36 2026
  read: IOPS=49, BW=49.9MiB/s (52.3MB/s)(9547MiB/191493msec)
    slat (usec): min=16, max=236700, avg=25530.03, stdev=49263.32
    clat (msec): min=10, max=1083, avg=787.98, stdev=86.45
     lat (msec): min=184, max=1126, avg=813.52, stdev=83.07
    clat percentiles (msec):
     |  1.00th=[  575],  5.00th=[  651], 10.00th=[  684], 20.00th=[  726],
     | 30.00th=[  751], 40.00th=[  776], 50.00th=[  793], 60.00th=[  810],
     | 70.00th=[  835], 80.00th=[  852], 90.00th=[  885], 95.00th=[  919],
     | 99.00th=[  978], 99.50th=[ 1003], 99.90th=[ 1045], 99.95th=[ 1062],
     | 99.99th=[ 1083]
   bw (  KiB/s): min=106300, max=225394, per=100.00%, avg=160706.87, stdev=5586.82, samples=472
   iops        : min=  103, max=  220, avg=156.21, stdev= 5.45, samples=472
  lat (msec)   : 20=0.01%, 250=0.19%, 500=0.41%, 750=28.64%, 1000=71.55%
  lat (msec)   : 2000=0.51%
  cpu          : usr=0.01%, sys=0.04%, ctx=2700, majf=0, minf=238
  IO depths    : 1=0.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwts: total=9419,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32
rand_write_4k: (groupid=2, jobs=4): err= 0: pid=3076575: Fri Apr  3 23:02:36 2026
  write: IOPS=1105, BW=4428KiB/s (4534kB/s)(544MiB/125782msec); 0 zone resets
    slat (usec): min=4, max=1924.6k, avg=164.44, stdev=14906.86
    clat (msec): min=5, max=1987, avg=55.16, stdev=87.48
     lat (msec): min=5, max=1987, avg=55.33, stdev=88.72
    clat percentiles (msec):
     |  1.00th=[   14],  5.00th=[   18], 10.00th=[   22], 20.00th=[   29],
     | 30.00th=[   35], 40.00th=[   41], 50.00th=[   46], 60.00th=[   52],
     | 70.00th=[   59], 80.00th=[   69], 90.00th=[   86], 95.00th=[  101],
     | 99.00th=[  167], 99.50th=[  397], 99.90th=[ 1854], 99.95th=[ 1905],
     | 99.99th=[ 1972]
   bw (  KiB/s): min= 1087, max=18003, per=100.00%, avg=9753.68, stdev=847.50, samples=451
   iops        : min=  271, max= 4500, avg=2437.55, stdev=211.90, samples=451
  lat (msec)   : 10=0.10%, 20=8.23%, 50=49.84%, 100=36.81%, 250=4.41%
  lat (msec)   : 500=0.43%, 750=0.04%, 1000=0.02%, 2000=0.20%
  cpu          : usr=0.11%, sys=0.70%, ctx=64650, majf=0, minf=237
  IO depths    : 1=0.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,139112,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32
rand_read_4k: (groupid=3, jobs=4): err= 0: pid=3076731: Fri Apr  3 23:02:36 2026
  read: IOPS=461, BW=1847KiB/s (1891kB/s)(108MiB/60057msec)
    slat (nsec): min=1031, max=347577k, avg=8653238.87, stdev=23251885.51
    clat (msec): min=9, max=1543, avg=270.44, stdev=115.64
     lat (msec): min=9, max=1543, avg=279.08, stdev=117.93
    clat percentiles (msec):
     |  1.00th=[  116],  5.00th=[  134], 10.00th=[  146], 20.00th=[  197],
     | 30.00th=[  205], 40.00th=[  213], 50.00th=[  259], 60.00th=[  271],
     | 70.00th=[  284], 80.00th=[  338], 90.00th=[  409], 95.00th=[  485],
     | 99.00th=[  684], 99.50th=[  802], 99.90th=[ 1036], 99.95th=[ 1099],
     | 99.99th=[ 1351]
   bw (  KiB/s): min=  816, max= 2336, per=100.00%, avg=1851.31, stdev=57.73, samples=476
   iops        : min=  204, max=  584, avg=462.61, stdev=14.43, samples=476
  lat (msec)   : 10=0.01%, 20=0.01%, 50=0.05%, 100=0.73%, 250=45.91%
  lat (msec)   : 500=49.38%, 750=3.54%, 1000=0.57%, 2000=0.14%
  cpu          : usr=0.03%, sys=0.07%, ctx=3727, majf=0, minf=233
  IO depths    : 1=0.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwts: total=27724,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32

Run status group 0 (all jobs):
  WRITE: bw=30.0MiB/s (31.5MB/s), 30.0MiB/s-30.0MiB/s (31.5MB/s-31.5MB/s), io=7723MiB (8098MB), run=257155-257155msec

Run status group 1 (all jobs):
   READ: bw=49.9MiB/s (52.3MB/s), 49.9MiB/s-49.9MiB/s (52.3MB/s-52.3MB/s), io=9547MiB (10.0GB), run=191493-191493msec

Run status group 2 (all jobs):
  WRITE: bw=4428KiB/s (4534kB/s), 4428KiB/s-4428KiB/s (4534kB/s-4534kB/s), io=544MiB (570MB), run=125782-125782msec

Run status group 3 (all jobs):
   READ: bw=1847KiB/s (1891kB/s), 1847KiB/s-1847KiB/s (1891kB/s-1891kB/s), io=108MiB (114MB), run=60057-60057msec

Disk stats (read/write):
  sdd: ios=50431/69440, merge=4/106182, ticks=7857304/5194951, in_queue=13058387, util=99.45%

seq_write: (groupid=0, jobs=4): err= 0: pid=3076324: Fri Apr  3 23:02:36 2026
  write: IOPS=125, BW=128MiB/s (134MB/s)(7723MiB/60285msec); 0 zone resets
    slat (usec): min=26, max=7536.3k, avg=31656.57, stdev=189405.34
    clat (msec): min=44, max=30930, avg=973.98, stdev=2596.20
     lat (msec): min=47, max=31261, avg=1005.54, stdev=2658.98
    clat percentiles (msec):
     |  1.00th=[  188],  5.00th=[  234], 10.00th=[  255], 20.00th=[  275],
     | 30.00th=[  477], 40.00th=[  531], 50.00th=[  550], 60.00th=[  575],
     | 70.00th=[  609], 80.00th=[  684], 90.00th=[  818], 95.00th=[ 1318],
     | 99.00th=[14160], 99.50th=[17113], 99.90th=[17113], 99.95th=[17113],
     | 99.99th=[17113]
   bw (  KiB/s): min=18136, max=377262, per=100.00%, avg=148623.17, stdev=23039.05, samples=374
   iops        : min=   14, max=  368, avg=144.32, stdev=22.55, samples=374
  lat (msec)   : 50=0.04%, 100=0.04%, 250=8.52%, 500=24.61%, 750=53.69%
  lat (msec)   : 1000=7.49%, 2000=3.02%, >=2000=4.23%
  cpu          : usr=0.03%, sys=0.04%, ctx=4167, majf=0, minf=237
  IO depths    : 1=0.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=99.9%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,7595,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32
seq_read: (groupid=1, jobs=4): err= 0: pid=3076454: Fri Apr  3 23:02:36 2026
  read: IOPS=156, BW=158MiB/s (166MB/s)(9547MiB/60317msec)
    slat (usec): min=16, max=236700, avg=25530.03, stdev=49263.32
    clat (msec): min=10, max=1083, avg=787.98, stdev=86.45
     lat (msec): min=184, max=1126, avg=813.52, stdev=83.07
    clat percentiles (msec):
     |  1.00th=[  575],  5.00th=[  651], 10.00th=[  684], 20.00th=[  726],
     | 30.00th=[  751], 40.00th=[  776], 50.00th=[  793], 60.00th=[  810],
     | 70.00th=[  835], 80.00th=[  852], 90.00th=[  885], 95.00th=[  919],
     | 99.00th=[  978], 99.50th=[ 1003], 99.90th=[ 1045], 99.95th=[ 1062],
     | 99.99th=[ 1083]
   bw (  KiB/s): min=106300, max=225394, per=99.15%, avg=160706.87, stdev=5586.82, samples=472
   iops        : min=  103, max=  220, avg=156.21, stdev= 5.45, samples=472
  lat (msec)   : 20=0.01%, 250=0.19%, 500=0.41%, 750=28.64%, 1000=71.55%
  lat (msec)   : 2000=0.51%
  cpu          : usr=0.01%, sys=0.04%, ctx=2700, majf=0, minf=238
  IO depths    : 1=0.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwts: total=9419,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32
rand_write_4k: (groupid=2, jobs=4): err= 0: pid=3076575: Fri Apr  3 23:02:36 2026
  write: IOPS=2316, BW=9275KiB/s (9497kB/s)(544MiB/60049msec); 0 zone resets
    slat (usec): min=4, max=1924.6k, avg=164.44, stdev=14906.86
    clat (msec): min=5, max=1987, avg=55.16, stdev=87.48
     lat (msec): min=5, max=1987, avg=55.33, stdev=88.72
    clat percentiles (msec):
     |  1.00th=[   14],  5.00th=[   18], 10.00th=[   22], 20.00th=[   29],
     | 30.00th=[   35], 40.00th=[   41], 50.00th=[   46], 60.00th=[   52],
     | 70.00th=[   59], 80.00th=[   69], 90.00th=[   86], 95.00th=[  101],
     | 99.00th=[  167], 99.50th=[  397], 99.90th=[ 1854], 99.95th=[ 1905],
     | 99.99th=[ 1972]
   bw (  KiB/s): min= 1087, max=18003, per=100.00%, avg=9753.68, stdev=847.50, samples=451
   iops        : min=  271, max= 4500, avg=2437.55, stdev=211.90, samples=451
  lat (msec)   : 10=0.10%, 20=8.23%, 50=49.84%, 100=36.81%, 250=4.41%
  lat (msec)   : 500=0.43%, 750=0.04%, 1000=0.02%, 2000=0.20%
  cpu          : usr=0.11%, sys=0.70%, ctx=64650, majf=0, minf=237
  IO depths    : 1=0.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,139112,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32
rand_read_4k: (groupid=3, jobs=4): err= 0: pid=3076731: Fri Apr  3 23:02:36 2026
  read: IOPS=455, BW=1831KiB/s (1875kB/s)(109MiB/60839msec)
    slat (nsec): min=1031, max=347577k, avg=8653238.87, stdev=23251885.51
    clat (msec): min=9, max=1572, avg=271.34, stdev=118.79
     lat (msec): min=9, max=1572, avg=279.99, stdev=121.07
    clat percentiles (msec):
     |  1.00th=[  116],  5.00th=[  134], 10.00th=[  146], 20.00th=[  197],
     | 30.00th=[  205], 40.00th=[  213], 50.00th=[  259], 60.00th=[  271],
     | 70.00th=[  284], 80.00th=[  338], 90.00th=[  409], 95.00th=[  485],
     | 99.00th=[  709], 99.50th=[  835], 99.90th=[ 1099], 99.95th=[ 1234],
     | 99.99th=[ 1351]
   bw (  KiB/s): min=  680, max= 2336, per=100.00%, avg=1842.53, stdev=62.61, samples=480
   iops        : min=  170, max=  584, avg=460.41, stdev=15.66, samples=480
  lat (msec)   : 10=0.01%, 20=0.01%, 50=0.05%, 100=0.73%, 250=45.91%
  lat (msec)   : 500=49.38%, 750=3.54%, 1000=0.61%, 2000=0.22%
  cpu          : usr=0.03%, sys=0.07%, ctx=3907, majf=0, minf=237
  IO depths    : 1=0.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwts: total=27724,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32

Run status group 0 (all jobs):
  WRITE: bw=128MiB/s (134MB/s), 128MiB/s-128MiB/s (134MB/s-134MB/s), io=7723MiB (8098MB), run=60285-60285msec

Run status group 1 (all jobs):
   READ: bw=158MiB/s (166MB/s), 158MiB/s-158MiB/s (166MB/s-166MB/s), io=9547MiB (10.0GB), run=60317-60317msec

Run status group 2 (all jobs):
  WRITE: bw=9275KiB/s (9497kB/s), 9275KiB/s-9275KiB/s (9497kB/s-9497kB/s), io=544MiB (570MB), run=60049-60049msec

Run status group 3 (all jobs):
   READ: bw=1831KiB/s (1875kB/s), 1831KiB/s-1831KiB/s (1875kB/s-1875kB/s), io=109MiB (114MB), run=60839-60839msec

Disk stats (read/write):
  sdd: ios=50431/69440, merge=4/106182, ticks=7857304/5194951, in_queue=13058387, util=99.45%

── Summary ───────────────────────────────────────────
  seq_write: (g=0): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=32
  seq_read: (g=1): rw=read, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=32
  seq_write: Laying out IO file (1 file / 1024MiB)
  seq_write: Laying out IO file (1 file / 1024MiB)
  seq_write: Laying out IO file (1 file / 1024MiB)
[...]
  seq_read: Laying out IO file (1 file / 1024MiB)
  seq_read: Laying out IO file (1 file / 1024MiB)
  seq_read: Laying out IO file (1 file / 1024MiB)
[...]
  seq_write: (groupid=0, jobs=4): err= 0: pid=3076324: Fri Apr  3 22:58:49 2026
  write: IOPS=140, BW=139MiB/s (146MB/s)(4175MiB/30029msec); 0 zone resets
  WRITE: bw=139MiB/s (146MB/s), 139MiB/s-139MiB/s (146MB/s-146MB/s), io=4175MiB (4378MB), run=30029-30029msec
  seq_write: (groupid=0, jobs=4): err= 0: pid=3076324: Fri Apr  3 22:59:19 2026
  write: IOPS=126, BW=127MiB/s (133MB/s)(7596MiB/60028msec); 0 zone resets
  WRITE: bw=127MiB/s (133MB/s), 127MiB/s-127MiB/s (133MB/s-133MB/s), io=7596MiB (7965MB), run=60028-60028msec
  seq_write: (groupid=0, jobs=4): err= 0: pid=3076324: Fri Apr  3 22:59:54 2026
  write: IOPS=79, BW=80.7MiB/s (84.6MB/s)(7723MiB/95725msec); 0 zone resets
  seq_read: (groupid=1, jobs=4): err= 0: pid=3076454: Fri Apr  3 22:59:54 2026
  read: IOPS=157, BW=157MiB/s (165MB/s)(4718MiB/30062msec)
  WRITE: bw=80.7MiB/s (84.6MB/s), 80.7MiB/s-80.7MiB/s (84.6MB/s-84.6MB/s), io=7723MiB (8098MB), run=95725-95725msec
  READ: bw=157MiB/s (165MB/s), 157MiB/s-157MiB/s (165MB/s-165MB/s), io=4718MiB (4947MB), run=30062-30062msec
  seq_write: (groupid=0, jobs=4): err= 0: pid=3076324: Fri Apr  3 23:00:24 2026
  write: IOPS=60, BW=61.4MiB/s (64.4MB/s)(7723MiB/125725msec); 0 zone resets
  seq_read: (groupid=1, jobs=4): err= 0: pid=3076454: Fri Apr  3 23:00:24 2026
  read: IOPS=156, BW=157MiB/s (164MB/s)(9421MiB/60062msec)
  WRITE: bw=61.4MiB/s (64.4MB/s), 61.4MiB/s-61.4MiB/s (64.4MB/s-64.4MB/s), io=7723MiB (8098MB), run=125725-125725msec
  READ: bw=157MiB/s (164MB/s), 157MiB/s-157MiB/s (164MB/s-164MB/s), io=9421MiB (9879MB), run=60062-60062msec
  seq_write: (groupid=0, jobs=4): err= 0: pid=3076324: Fri Apr  3 23:01:00 2026
  write: IOPS=46, BW=47.7MiB/s (50.1MB/s)(7723MiB/161740msec); 0 zone resets
  seq_read: (groupid=1, jobs=4): err= 0: pid=3076454: Fri Apr  3 23:01:00 2026
  read: IOPS=98, BW=99.4MiB/s (104MB/s)(9547MiB/96078msec)
  write: IOPS=2492, BW=9963KiB/s (10.2MB/s)(295MiB/30367msec); 0 zone resets
  WRITE: bw=47.7MiB/s (50.1MB/s), 47.7MiB/s-47.7MiB/s (50.1MB/s-50.1MB/s), io=7723MiB (8098MB), run=161740-161740msec
  READ: bw=99.4MiB/s (104MB/s), 99.4MiB/s-99.4MiB/s (104MB/s-104MB/s), io=9547MiB (10.0GB), run=96078-96078msec
  WRITE: bw=9963KiB/s (10.2MB/s), 9963KiB/s-9963KiB/s (10.2MB/s-10.2MB/s), io=295MiB (310MB), run=30367-30367msec
  seq_write: (groupid=0, jobs=4): err= 0: pid=3076324: Fri Apr  3 23:01:30 2026
  write: IOPS=39, BW=40.3MiB/s (42.2MB/s)(7723MiB/191740msec); 0 zone resets
  seq_read: (groupid=1, jobs=4): err= 0: pid=3076454: Fri Apr  3 23:01:30 2026
  read: IOPS=74, BW=75.7MiB/s (79.4MB/s)(9547MiB/126078msec)
  write: IOPS=2304, BW=9224KiB/s (9445kB/s)(544MiB/60367msec); 0 zone resets
  WRITE: bw=40.3MiB/s (42.2MB/s), 40.3MiB/s-40.3MiB/s (42.2MB/s-42.2MB/s), io=7723MiB (8098MB), run=191740-191740msec
  READ: bw=75.7MiB/s (79.4MB/s), 75.7MiB/s-75.7MiB/s (79.4MB/s-79.4MB/s), io=9547MiB (10.0GB), run=126078-126078msec
  WRITE: bw=9224KiB/s (9445kB/s), 9224KiB/s-9224KiB/s (9445kB/s-9445kB/s), io=544MiB (570MB), run=60367-60367msec
  seq_write: (groupid=0, jobs=4): err= 0: pid=3076324: Fri Apr  3 23:02:06 2026
  write: IOPS=33, BW=34.0MiB/s (35.7MB/s)(7723MiB/227155msec); 0 zone resets
  seq_read: (groupid=1, jobs=4): err= 0: pid=3076454: Fri Apr  3 23:02:06 2026
  read: IOPS=58, BW=59.1MiB/s (62.0MB/s)(9547MiB/161493msec)
  write: IOPS=1452, BW=5815KiB/s (5954kB/s)(544MiB/95783msec); 0 zone resets
  read: IOPS=463, BW=1850KiB/s (1895kB/s)(54.3MiB/30057msec)
  WRITE: bw=34.0MiB/s (35.7MB/s), 34.0MiB/s-34.0MiB/s (35.7MB/s-35.7MB/s), io=7723MiB (8098MB), run=227155-227155msec
  READ: bw=59.1MiB/s (62.0MB/s), 59.1MiB/s-59.1MiB/s (62.0MB/s-62.0MB/s), io=9547MiB (10.0GB), run=161493-161493msec
  WRITE: bw=5815KiB/s (5954kB/s), 5815KiB/s-5815KiB/s (5954kB/s-5954kB/s), io=544MiB (570MB), run=95783-95783msec
  READ: bw=1850KiB/s (1895kB/s), 1850KiB/s-1850KiB/s (1895kB/s-1895kB/s), io=54.3MiB (57.0MB), run=30057-30057msec
  seq_write: (groupid=0, jobs=4): err= 0: pid=3076324: Fri Apr  3 23:02:36 2026
  write: IOPS=29, BW=30.0MiB/s (31.5MB/s)(7723MiB/257155msec); 0 zone resets
  seq_read: (groupid=1, jobs=4): err= 0: pid=3076454: Fri Apr  3 23:02:36 2026
  read: IOPS=49, BW=49.9MiB/s (52.3MB/s)(9547MiB/191493msec)
  write: IOPS=1105, BW=4428KiB/s (4534kB/s)(544MiB/125782msec); 0 zone resets
  read: IOPS=461, BW=1847KiB/s (1891kB/s)(108MiB/60057msec)
  WRITE: bw=30.0MiB/s (31.5MB/s), 30.0MiB/s-30.0MiB/s (31.5MB/s-31.5MB/s), io=7723MiB (8098MB), run=257155-257155msec
  READ: bw=49.9MiB/s (52.3MB/s), 49.9MiB/s-49.9MiB/s (52.3MB/s-52.3MB/s), io=9547MiB (10.0GB), run=191493-191493msec
  WRITE: bw=4428KiB/s (4534kB/s), 4428KiB/s-4428KiB/s (4534kB/s-4534kB/s), io=544MiB (570MB), run=125782-125782msec
  READ: bw=1847KiB/s (1891kB/s), 1847KiB/s-1847KiB/s (1891kB/s-1891kB/s), io=108MiB (114MB), run=60057-60057msec
  seq_write: (groupid=0, jobs=4): err= 0: pid=3076324: Fri Apr  3 23:02:36 2026
  write: IOPS=125, BW=128MiB/s (134MB/s)(7723MiB/60285msec); 0 zone resets
  seq_read: (groupid=1, jobs=4): err= 0: pid=3076454: Fri Apr  3 23:02:36 2026
  read: IOPS=156, BW=158MiB/s (166MB/s)(9547MiB/60317msec)
  write: IOPS=2316, BW=9275KiB/s (9497kB/s)(544MiB/60049msec); 0 zone resets
  read: IOPS=455, BW=1831KiB/s (1875kB/s)(109MiB/60839msec)
  WRITE: bw=128MiB/s (134MB/s), 128MiB/s-128MiB/s (134MB/s-134MB/s), io=7723MiB (8098MB), run=60285-60285msec
  READ: bw=158MiB/s (166MB/s), 158MiB/s-158MiB/s (166MB/s-166MB/s), io=9547MiB (10.0GB), run=60317-60317msec
  WRITE: bw=9275KiB/s (9497kB/s), 9275KiB/s-9275KiB/s (9497kB/s-9497kB/s), io=544MiB (570MB), run=60049-60049msec
  READ: bw=1831KiB/s (1875kB/s), 1831KiB/s-1831KiB/s (1875kB/s-1875kB/s), io=109MiB (114MB), run=60839-60839msec